<?php

  /*
    Control Structure
    - Including Files

    Include
    Require
    الثنين بعملو نفس المهمة لكن الفرق بينهم أن الإنكلود اذا ما لقى الملف
    بطبع الكود اللي بعديه 
    لكن الريكواير اذا ما لقى الملف ما بطبع الكود اللي بعديه
    الريكواير بأدي نفس وظيفة الداي بهاي الحالة
    الداي اللي بتطبع الجملة اللي بدي اياها في حال كان عندي ايرور وما بتطبع أي كود بعديها
  */

  include_once("42-test.php"); // $a = 10;
  // include_once بتعمل أنكلود مرة وحدة 
  // أما الإنكلود لحالها بتعمل أنكلود قد ما بدك
  // ونفس الحكي بتطبق على الريكواير والريكواير ونس 

  echo $a . '<br>';

  $a = 20;

  include_once("42-test.php"); // هون بتأكد اذا انك عامل إنكلود قبل هيك او لا 
  // اذا انك عامل إنكلود ما رح يعمل إنكلود مرة تانية, لذلك ما طبع قيمة ال آي اللي في ملف ال تيست
   // $a = 10;

  echo $a . '<br>';

  echo "Continue";




  echo "<br><hr>";

  include("42-test.php"); // $a = 10;

  echo $a . '<br>';

  $a = 20;

  include("42-test.php"); // $a = 10;

  echo $a . '<br>';

  echo "Continue";

